Tekla Open API Reference for Tekla Structures 2025
Enum<E>.WriteXml Method
[Missing <summary> documentation for "M:Tekla.Structures.Datatype.Enum`1.WriteXml(System.Xml.XmlWriter)"]
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void WriteXml(
	XmlWriter writer
)
Public Sub WriteXml (
	writer As XmlWriter
)
Parameters
writer
Type: System.Xml.XmlWriter
[Missing <param name="writer"/> documentation for "M:Tekla.Structures.Datatype.Enum`1.WriteXml(System.Xml.XmlWriter)"]
Implements
IXmlSerializable.WriteXml(XmlWriter)
See Also
Reference
Enum<E> Structure
Tekla.Structures.Datatype Namespace